УТ_для_edt/src/Catalogs/CRM_КатегорииРешений/CRM_КатегорииРешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_КатегорииРешений</name>
  <comment>Категории решений базы знаний</comment>
  <predefined>
    <items>
      <name>ТекущиеПроблемы</name>
      <description>Выявленные текущие проблемы</description>
    </items>
    <items>
      <name>ДополнительнаяИнформация</name>
      <description>Дополнительная информация</description>
    </items>
    <items>
      <name>РекомендуемаяИнформация</name>
      <description>Рекомендуемая информация</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦветПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКрасный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗеленый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСиний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>101</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_КатегорииРешений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЪЕКТА

// Процедура - обработчик события "ПослеЗаписи".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(ЦветИндекс) Тогда
		ЦветИндекс			= 10;
		ЦветПредставление 	= НСтр("ru='Стальной';en='The steel'");
		ЦветКрасный  		= 216;
		ЦветЗеленый  		= 218;
		ЦветСиний  			= 229;
	КонецЕсли;
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
